Show / Hide Table of Contents
Class ConcreteULSCheckResultTorsionEc2
ULS Check Torsion Ec2
Inheritance
System.Object
ConcreteCheckResultBase
ConcreteULSCheckResultTorsion
ConcreteULSCheckResultTorsionEc2
Inherited Members
 ConcreteCheckResultBase.InternalFores
 ConcreteCheckResultBase.NonConformities
 ConcreteCheckResultBase.Result
 ConcreteCheckResultBase.CheckValue
 ConcreteCheckResultBase.LimitCheckValue
 ConcreteCheckResultBase.Check
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Concrete.CheckResult
Assembly: IdeaRS.OpenModel.dll
Syntax
public class ConcreteULSCheckResultTorsionEc2 : ConcreteULSCheckResultTorsion
Properties
Improve this Doc   View Source
Ted
Design value of the applied torsional moment
Declaration
public double Ted { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Trd
decisive design torsional resistance
Declaration
public double Trd { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Trdc
torsional cracking moment
Declaration
public double Trdc { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Trdmax
design torsional resistance moment
Declaration
public double Trdmax { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Trds
design torsional resistance moment of shear reinforcement
Declaration
public double Trds { get; set; }
Property Value
 Type |  Description
 System.Double
 Improve this Doc
 View Source